{
    "name": "Barbarian",
    "hit_die": 12,
    "primary_ability": "Strength",
    "saving_throws": ["Strength", "Constitution"],
    "starting_equipment": [
        {"name": "Greataxe", "quantity": 1},
        {"name": "Handaxe", "quantity": 2},
        {"name": "Javelin", "quantity": 4},
        {"name": "Explorer's pack", "quantity": 1}
    ],
    "Proficiency Bonus": [
        {"Level": 1, "Proficiency" : 2},
        {"Level": 2, "Proficiency" : 2},
        {"Level": 3, "Proficiency" : 2},
        {"Level": 4, "Proficiency" : 2},
        {"Level": 5, "Proficiency" : 3},
        {"Level": 6, "Proficiency" : 3},
        {"Level": 7, "Proficiency" : 3},
        {"Level": 8, "Proficiency" : 3},
        {"Level": 9, "Proficiency" : 4},
        {"Level": 10, "Proficiency" : 4},
        {"Level": 11, "Proficiency" : 4},
        {"Level": 12, "Proficiency" : 4},
        {"Level": 13, "Proficiency" : 5},
        {"Level": 14, "Proficiency" : 5},
        {"Level": 15, "Proficiency" : 5},
        {"Level": 16, "Proficiency" : 5},
        {"Level": 17, "Proficiency" : 6},
        {"Level": 18, "Proficiency" : 6},
        {"Level": 19, "Proficiency" : 6},
        {"Level": 20, "Proficiency" : 6}
    ],
    "Rages": [
        {"Level": 1, "Rages" : 2},
        {"Level": 2, "Rages" : 2},
        {"Level": 3, "Rages" : 3},
        {"Level": 4, "Rages" : 3},
        {"Level": 5, "Rages" : 3},
        {"Level": 6, "Rages" : 4},
        {"Level": 7, "Rages" : 4},
        {"Level": 8, "Rages" : 4},
        {"Level": 9, "Rages" : 4},
        {"Level": 10, "Rages" : 4},
        {"Level": 11, "Rages" : 4},
        {"Level": 12, "Rages" : 5},
        {"Level": 13, "Rages" : 5},
        {"Level": 14, "Rages" : 5},
        {"Level": 15, "Rages" : 5},
        {"Level": 16, "Rages" : 5},
        {"Level": 17, "Rages" : 6},
        {"Level": 18, "Rages" : 6},
        {"Level": 19, "Rages" : 6},
        {"Level": 20, "Rages" : "Unlimited"}
    ],
    "Rage Damage": [
        {"Level": 1, "Rage Damage" : 2},
        {"Level": 2, "Rage Damage" : 2},
        {"Level": 3, "Rage Damage" : 2},
        {"Level": 4, "Rage Damage" : 2},
        {"Level": 5, "Rage Damage" : 2},
        {"Level": 6, "Rage Damage" : 2},
        {"Level": 7, "Rage Damage" : 2},
        {"Level": 8, "Rage Damage" : 2},
        {"Level": 9, "Rage Damage" : 3},
        {"Level": 10, "Rage Damage" : 3},
        {"Level": 11, "Rage Damage" : 3},
        {"Level": 12, "Rage Damage" : 3},
        {"Level": 13, "Rage Damage" : 3},
        {"Level": 14, "Rage Damage" : 3},
        {"Level": 15, "Rage Damage" : 3},
        {"Level": 16, "Rage Damage" : 4},
        {"Level": 17, "Rage Damage" : 4},
        {"Level": 18, "Rage Damage" : 4},
        {"Level": 19, "Rage Damage" : 4},
        {"Level": 20, "Rage Damage" : 4}
    ],
    "armor_proficiencies": [
        "Light armor",
        "Medium armor",
        "Shields"
    ],
    "weapon_proficiencies": [
        "Simple weapons",
        "Martial weapons"
    ],
    "tool_proficiencies": [],
    "skill_choices": [
        {
            "choose": 2,
            "from": [
                "Animal Handling",
                "Athletics",
                "Intimidation",
                "Nature",
                "Perception",
                "Survival"
            ]
        }
    ],
    "class_features": [
        {
            "name": "Rage",
            "description": "On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits While raging, you gain the following benefits if you aren’t wearing heavy armor You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again.",
            "level": 1
        },
        {
            "name": "Unarmored Defense",
            "description": "While you are not wearing any armor, your AC equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
            "level": 1
        },
        {
            "name": "Reckless Attack",
            "description": "When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
            "level": 2
        },
        {
            "name": "Danger Sense",
            "description": "You gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated.",
            "level": 2,
            "Advantage": "Dexterity"
        },
        {
            "name": "Primal Path",
            "description":"At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
            "level": 3,
            "choose": 1 ,
            "from": [
                "Path of the Beserker",
                "Path of the Totem Warrior"
            ]
        },
        {
            "name": "Extra Attack",
            "description":"Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
            "level": 5
        },
        {
            "name": "Fast Movement",
            "description": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
            "level": 5
        },
        {
            "name": "Feral Instinct",
            "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls.Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
            "level": 7
        },
        {
            "name": "Brutal Critical",
            "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level.",
            "level": 9
        },
        {
            "name": "Relentless Rage",
            "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
            "level": 11
        },
        {
            "name": "Brutal Critical",
            "description": "At 13th level you can roll a second additional weapon damage die when determining the extra damage for a critical hit with a melee attack 13th level and three additional dice at 17th level.",
            "level": 13
        },
        {
            "name": "Persistent Rage",
            "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
            "level" : 15
        },
        {
            "name":"Brutal Critical",
            "description": "At 17th level you can roll a third additional weapon damage die when determining the extra damage for a critical hit with a melee attack",
            "level": 17
        },
        {
            "name": "Indomitable Might",
            "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
            "level": 18
        },
        {
            "name": "Primal Champion",
            "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
            "level": 20
        },
        {
            "name": "Path of the Berserker",
            "features": {
            "1": {
            "name": "Frenzy",
            "description": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A)."
            },
            "6": {
            "name": "Mindless Rage",
            "description": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
            },
            "10": {
            "name": "Intimidating Presence",
            "description": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you."
            },
            "14": {
            "name": "Retaliation",
            "description": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."
            }
        }   
    },
    {
            "name": "Path of the Totem Warrior",
            "features": {
            "3": {
            "name": "Spirit Seeker",
            "description": "At 3rd level, you gain the ability to call on the spirits for guidance. You can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek."
            },
            "6": {
            "name": "Totem Spirit",
            "description": "At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object - an amulet or similar adornment - that incorporates fur or feathers, claws, teeth, or bone of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick-skinned, or if your totem is the eagle, your eyes turn bright yellow."
            },
            "10": {
            "name": "Aspect of the Beast",
            "description": "At 10th level, you can choose a second option from the Totem Spirit feature."
            },
            "14": {
            "name": "Spirit Walker",
            "description": "At 14th level, you gain the ability to use the ethereal plane to travel quickly and stealthily. You can use your action to cast"
            }
        }
    }
    ]
}
    
